## `infra/terraform/beta`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_api_gateway_domain_name.libra: Reading...
data.aws_route53_zone.tomozo6_com: Reading...
data.aws_api_gateway_domain_name.libra: Read complete after 0s [id=beta.libra.tomozo6.com]
data.aws_route53_zone.tomozo6_com: Read complete after 1s [id=Z0406418180720KM8VM2D]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.libra will be created
  + resource "aws_dynamodb_table" "libra" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Payer"
      + id               = (known after apply)
      + name             = "libra-beta-dynamodb-table"
      + range_key        = "InputDate"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "InputDate"
          + type = "S"
        }
      + attribute {
          + name = "Payer"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_route53_record.libra will be created
  + resource "aws_route53_record" "libra" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beta.libra.tomozo6.com"
      + type            = "A"
      + zone_id         = "Z0406418180720KM8VM2D"

      + alias {
          + evaluate_target_health = false
          + name                   = "d-762cmy1n5a.execute-api.ap-northeast-1.amazonaws.com"
          + zone_id                = "Z1YSHQZHG15GKL"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tomozo6, Action: `pull_request`*